cf_billing/DataProcessors/энргУстановитьТарифнуюКатегориюВидБлагоустройстваАбонентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргУстановитьТарифнуюКатегориюВидБлагоустройстваАбонентам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаАбонентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргВидБлагоустройствАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВидБлагоустройствАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргГруппыПотребителейАбонентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргГруппыПотребителейАбонентов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАбонентыПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАбонентыПомещений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/энргУстановитьТарифнуюКатегориюВидБлагоустройстваАбонентам/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	
	Если ВидОперации = 0 Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ГруппыПотребителей.Услуга КАК Услуга,
		|	ГруппыПотребителей.ГруппаПотребителей КАК ГруппаПотребителей
		|ПОМЕСТИТЬ ВТ_ТЗГрупп
		|ИЗ
		|	&ГруппыПотребителей КАК ГруппыПотребителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗАбонентов.Абонент КАК Абонент,
		|	ТЗАбонентов.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_ТЗАбонентов
		|ИЗ
		|	&ТЗАбонентов КАК ТЗАбонентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВидБлагоустройствАбонентаСрезПоследних.Услуга КАК Услуга,
		|	энргВидБлагоустройствАбонентаСрезПоследних.ВидБлагоустройства КАК ВидБлагоустройства,
		|	ВТ_ТЗАбонентов.Абонент КАК Абонент,
		|	ВТ_ТЗАбонентов.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_ВидыБлагоустройств
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
		|			&Дата,
		|			КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ.КлючПомещения
		|					ИЗ
		|						ВТ_ТЗАбонентов КАК ВТ)
		|				И Организация = &Организация
		|				И Район = &Район) КАК энргВидБлагоустройствАбонентаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТЗГрупп КАК ВТ_ТЗГрупп
		|		ПО энргВидБлагоустройствАбонентаСрезПоследних.Услуга = ВТ_ТЗГрупп.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЗАбонентов КАК ВТ_ТЗАбонентов
		|		ПО энргВидБлагоустройствАбонентаСрезПоследних.КлючПомещения = ВТ_ТЗАбонентов.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_ТЗГрупп.ГруппаПотребителей, энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей) КАК ТарифнаяКатегория,
		|	ВТ_ТЗАбонентов.Абонент КАК Абонент,
		|	ВТ_ТЗАбонентов.КлючПомещения КАК КлючПомещения,
		|	энргГруппыПотребителейАбонентовСрезПоследних.Услуга КАК Услуга,
		|	ВТ_ВидыБлагоустройств.ВидБлагоустройства КАК ВидБлагоустройства
		|ИЗ
		|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
		|			&Дата,
		|			КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ.КлючПомещения
		|					ИЗ
		|						ВТ_ТЗАбонентов КАК ВТ)
		|				И Организация = &Организация
		|				И Район = &Район) КАК энргГруппыПотребителейАбонентовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЗГрупп КАК ВТ_ТЗГрупп
		|		ПО энргГруппыПотребителейАбонентовСрезПоследних.Услуга = ВТ_ТЗГрупп.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыБлагоустройств КАК ВТ_ВидыБлагоустройств
		|		ПО энргГруппыПотребителейАбонентовСрезПоследних.Услуга = ВТ_ВидыБлагоустройств.Услуга
		|			И энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения = ВТ_ВидыБлагоустройств.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЗАбонентов КАК ВТ_ТЗАбонентов
		|		ПО энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения = ВТ_ТЗАбонентов.КлючПомещения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТЗАбонентов.Абонент,
		|	ВТ_ТЗАбонентов.КлючПомещения,
		|	энргГруппыПотребителейАбонентовСрезПоследних.Услуга,
		|	ЕСТЬNULL(ВТ_ТЗГрупп.ГруппаПотребителей, энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей),
		|	ВТ_ВидыБлагоустройств.ВидБлагоустройства
		|ИТОГИ
		|	МАКСИМУМ(КлючПомещения)
		|ПО
		|	Абонент";
		
		СоздатьДокументыНаСервере(ТекстЗапроса, Документы["энргУстановитьГруппуПотребителейАбонента"], "ВидыБлагоустройстваТарифныеКатегории");
		
	ИначеЕсли  ВидОперации = 1 Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВидыБлагоустройства.Услуга КАК Услуга,
		|	ВидыБлагоустройства.ВидБлагоустройства КАК ВидБлагоустройства
		|ПОМЕСТИТЬ ВТ_ТЗВидов
		|ИЗ
		|	&ВидыБлагоустройства КАК ВидыБлагоустройства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗАбонентов.Абонент КАК Абонент,
		|	ТЗАбонентов.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_ТЗАбонентов
		|ИЗ
		|	&ТЗАбонентов КАК ТЗАбонентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВидБлагоустройствАбонентаСрезПоследних.Услуга КАК Услуга,
		|	ВТ_ТЗВидов.ВидБлагоустройства КАК ВидБлагоустройства,
		|	ВТ_ТЗАбонентов.Абонент КАК Абонент,
		|	ВТ_ТЗАбонентов.КлючПомещения КАК КлючПомещения
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
		|			&Дата,
		|			КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ.КлючПомещения
		|					ИЗ
		|						ВТ_ТЗАбонентов КАК ВТ)
		|				И Организация = &Организация
		|				И Район = &Район) КАК энргВидБлагоустройствАбонентаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТЗВидов КАК ВТ_ТЗВидов
		|		ПО энргВидБлагоустройствАбонентаСрезПоследних.Услуга = ВТ_ТЗВидов.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЗАбонентов КАК ВТ_ТЗАбонентов
		|		ПО энргВидБлагоустройствАбонентаСрезПоследних.КлючПомещения = ВТ_ТЗАбонентов.КлючПомещения
		|ИТОГИ
		|	МАКСИМУМ(КлючПомещения)
		|ПО
		|	Абонент";
		
		СоздатьДокументыНаСервере(ТекстЗапроса, Документы["энргУстановитьВидБлагоустройстваАбонента"], "ВидыБлагоустройств");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере(ТекстЗапроса, ДокументМенеджер, ИмяТЧ)
	ПериодНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Организация, Район);
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ГруппыПотребителей",		ГруппыПотребителей.Выгрузить());
	Запрос.УстановитьПараметр("ВидыБлагоустройства",	ВидыБлагоустройств.Выгрузить());
	Запрос.УстановитьПараметр("Дата",					Объект.Дата);
	Запрос.УстановитьПараметр("ТЗАбонентов",			Абоненты.Выгрузить());
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	
	РезультатЗапросаАбоненты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока РезультатЗапросаАбоненты.Следующий() Цикл
		Док 						= ДокументМенеджер.СоздатьДокумент();
		Док.Дата					= Объект.Дата;
		Док.ПериодНачисления		= ПериодНачисления;
		Док.Абонент					= РезультатЗапросаАбоненты.Абонент;
		Док.Организация				= Организация;
		Док.Район					= Район;
		Док.КлючПомещения			= РезультатЗапросаАбоненты.КлючПомещения;		
		Док.Контроллер				= Объект.Контроллер;
		Док.Примечание				= "Создан обработкой от " + Объект.Дата;
		
		ВыборкаДетальныеЗаписи = РезультатЗапросаАбоненты.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтр = Док[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		Док.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеФайла", Истина);
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Док.Ссылка) + " был создан и проведен!", Док.Ссылка);
		Исключение
			Док.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Док.Ссылка) + " был создан и записан без проведения!", Док.Ссылка);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Элементы.ГруппыПотребителей.Видимость = ВидОперации = 0;
	Элементы.ВидыБлагоустройств.Видимость = ВидОперации = 1;
	
	Если ВидОперации = 0 Тогда 
		
		Элементы.ТарифнаяКатегорияНовый.Видимость = Истина;
		Элементы.ТарифнаяКатегорияТекущий.Видимость = Истина;
		
		Элементы.ВидБлагоустройстваНовый.Видимость = Ложь;
		Элементы.ВидБлагоустройстваТекущий.Видимость = Ложь;
		
	ИначеЕсли ВидОперации = 1 Тогда
		
		Элементы.ТарифнаяКатегорияНовый.Видимость = Ложь;
		Элементы.ТарифнаяКатегорияТекущий.Видимость = Ложь;
		
		Элементы.ВидБлагоустройстваНовый.Видимость = Истина;
		Элементы.ВидБлагоустройстваТекущий.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Дата",					Объект.Дата);
	СтруктураРеквизитов.Вставить("Абоненты",				Абоненты);
	СтруктураРеквизитов.Вставить("Организация",				Организация);
	СтруктураРеквизитов.Вставить("Район",					Район);
	СтруктураРеквизитов.Вставить("Услуга",					Услуга);
	Для каждого стр из СтруктураРеквизитов Цикл
		Если Не ЗначениеЗаполнено(стр.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение реквизита '" + стр.Ключ + "'!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	Если Не Отказ Тогда
		ВыполнитьОбработкуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ЗаполнитьАбоненты();
	
	Если ВидОперации = 0 Тогда
		
		ГруппыПотребителей.Очистить();
		
		Для Каждого Строка из СоставляющиеУслуги Цикл
			
			Таб = ГруппыПотребителей.Добавить();
			
			Таб.Услуга = Строка.Услуга;
			
			таб.ГруппаПотребителей = ТарифнаяКатегорияНовый;
			
		КонецЦикла;
		
	ИначеЕсли  ВидОперации = 1 Тогда
		
		ВидыБлагоустройств.Очистить();
		
		Для Каждого Строка из СоставляющиеУслуги Цикл
			
			Таб = ВидыБлагоустройств.Добавить();
			
			Таб.Услуга = Строка.Услуга;
			
			таб.ВидБлагоустройства = ВидБлагоустройстваНовый;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл1(Команда)
	
	ПрочитатьФайл();
	
	ПолучитьСоставляющиеУслуги();
	
	Если ВидОперации = 0 Тогда
		
		ГруппыПотребителей.Очистить();
		
		Для Каждого Строка из СоставляющиеУслуги Цикл
			
			Таб = ГруппыПотребителей.Добавить();
			
			Таб.Услуга = Строка.Услуга;
			
			таб.ГруппаПотребителей = ТарифнаяКатегорияНовый;
			
		КонецЦикла;
		
	ИначеЕсли  ВидОперации = 1 Тогда
		
		ВидыБлагоустройств.Очистить();
		
		Для Каждого Строка из СоставляющиеУслуги Цикл
			
			Таб = ВидыБлагоустройств.Добавить();
			
			Таб.Услуга = Строка.Услуга;
			
			таб.ВидБлагоустройства = ВидБлагоустройстваНовый;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьАбоненты()
	
	СоставляющиеУслуги.Очистить();
	
	Если Услуга.СоставнаяУслуга Тогда
		
		Для Каждого Строка из Услуга.СоставляющиеУслуг Цикл
			
			Таб = СоставляющиеУслуги.Добавить();
			Таб.Услуга = Строка.Услуга;
			
		КонецЦикла;
		
	Иначе 
		
		Таб = СоставляющиеУслуги.Добавить();
		Таб.Услуга = Услуга;
		
	КонецЕсли;
	
	Массив = СоставляющиеУслуги.Выгрузить();
	
	Если ВидОперации = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_КлючиПомещений
		|ИЗ
		|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.Строение В(&Строение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей
		|ПОМЕСТИТЬ ВТ_КлючипомещенийТарифнойКатегории
		|ИЗ
		|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
		|			&Дата,
		|			Услуга В (&Услуга)
		|				И Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_КлючиПомещений.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_КлючиПомещений КАК ВТ_КлючиПомещений)) КАК энргГруппыПотребителейАбонентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КлючипомещенийТарифнойКатегории.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_КлючипомещенийТарифнойКатегорииДоп
		|ИЗ
		|	ВТ_КлючипомещенийТарифнойКатегории КАК ВТ_КлючипомещенийТарифнойКатегории
		|ГДЕ
		|	ВТ_КлючипомещенийТарифнойКатегории.ГруппаПотребителей = &ТарифнаяКатегорияТекущий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргАбонентыПомещенийСрезПоследних.Абонент КАК Абонент,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения
		|ИЗ
		|	РегистрСведений.энргАбонентыПомещений.СрезПоследних(
		|			&Дата,
		|			Услуга = &УслугаСоставная
		|				И Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_КлючипомещенийТарифнойКатегорииДоп.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_КлючипомещенийТарифнойКатегорииДоп КАК ВТ_КлючипомещенийТарифнойКатегорииДоп)) КАК энргАбонентыПомещенийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО энргАбонентыПомещенийСрезПоследних.Абонент = энргАбоненты.Ссылка";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Район", Район);
		Запрос.УстановитьПараметр("Строение", Строения);
		Запрос.УстановитьПараметр("ТарифнаяКатегорияТекущий", ТарифнаяКатегорияТекущий);
		Запрос.УстановитьПараметр("Услуга", Массив);
		Запрос.УстановитьПараметр("УслугаСоставная", Услуга);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Абоненты.Очистить();
		
		Пока Выборка.Следующий() Цикл
			
			Таб = Абоненты.Добавить();
			
			ЗаполнитьЗначенияСвойств(Таб, Выборка);
		КонецЦикла;
		
	ИначеЕсли  ВидОперации = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_КлючиПомещений
		|ИЗ
		|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.Строение В(&Строение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВидБлагоустройствАбонентаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргВидБлагоустройствАбонентаСрезПоследних.ВидБлагоустройства КАК ВидБлагоустройства
		|ПОМЕСТИТЬ ВТ_КлючипомещенийВидыБлагоустройств
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
		|			&Дата,
		|			Услуга В (&Услуга)
		|				И Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_КлючиПомещений.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_КлючиПомещений КАК ВТ_КлючиПомещений)) КАК энргВидБлагоустройствАбонентаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КлючипомещенийВидыБлагоустройств.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_КлючипомещенийВидыБлагоустройствДоп
		|ИЗ
		|	ВТ_КлючипомещенийВидыБлагоустройств КАК ВТ_КлючипомещенийВидыБлагоустройств
		|ГДЕ
		|	ВТ_КлючипомещенийВидыБлагоустройств.ВидБлагоустройства = &ВидБлагоустройстваТекущий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргАбонентыПомещенийСрезПоследних.Абонент КАК Абонент,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения
		|ИЗ
		|	РегистрСведений.энргАбонентыПомещений.СрезПоследних(
		|			&Дата,
		|			Услуга = &УслугаСоставная
		|				И Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_КлючипомещенийВидыБлагоустройствДоп.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_КлючипомещенийВидыБлагоустройствДоп КАК ВТ_КлючипомещенийВидыБлагоустройствДоп)) КАК энргАбонентыПомещенийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО энргАбонентыПомещенийСрезПоследних.Абонент = энргАбоненты.Ссылка";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Район", Район);
		Запрос.УстановитьПараметр("Строение", Строения);
		Запрос.УстановитьПараметр("ВидБлагоустройстваТекущий", ВидБлагоустройстваТекущий);
		Запрос.УстановитьПараметр("Услуга", Массив);
		Запрос.УстановитьПараметр("УслугаСоставная", Услуга);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Абоненты.Очистить();
		
		Пока Выборка.Следующий() Цикл
			
			Таб = Абоненты.Добавить();
			
			ЗаполнитьЗначенияСвойств(Таб, Выборка);
			
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ФайлДляЧтения = ДиалогВыбораФайла.ПолноеИмяФайла;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel(ТЗ = Неопределено, ЛистЭксель, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок, Эксель) 
	
	Сч = 0;
	Ат = НомерПервойСтроки;
	Для Строка = НомерПервойСтроки По ВсегоСтрок Цикл                                                         
		Если не ПустаяСтрока(Эксель.Cells(Строка,1).value) Тогда 
			
			ЛС.Добавить(СокрЛП(ЛистЭксель.Cells(Строка,1).text));
			
			Сч = Сч + 1;
			
		иначе Прервать;	
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьАбонентовИзФайла();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("Загружено " + Сч + " Абонента/ов"));
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСоставляющиеУслуги()
	
	СоставляющиеУслуги.Очистить();
	
	Если Услуга.СоставнаяУслуга Тогда
		
		Для Каждого Строка из Услуга.СоставляющиеУслуг Цикл
			
			Таб = СоставляющиеУслуги.Добавить();
			Таб.Услуга = Строка.Услуга;
			
		КонецЦикла;
		
	Иначе 
		
		Таб = СоставляющиеУслуги.Добавить();
		Таб.Услуга = Услуга;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАбонентовИзФайла()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргАбоненты.Ссылка КАК Ссылка,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	Справочник.энргАбоненты КАК энргАбоненты
	|ГДЕ
	|	энргАбоненты.ЛицевойСчет В(&ЛицевойСчет)";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Абоненты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Таб = Абоненты.Добавить();
		
		Таб.АБонент = Выборка.Ссылка;
		Таб.КлючПомещения = Выборка.КлючПомещения;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Если НЕ МобильныйКлиент Тогда

&НаКлиенте
Процедура ПрочитатьФайл()
	
	ЛС.Очистить();
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Книга = Эксель.WorkBooks.Open(ФайлДляЧтения);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	RangeAll = Книга.ActiveSheet.UsedRange;
	ВсегоСтрок= RangeAll.Rows.Count;
	Попытка
		Страница = Книга.Worksheets(1);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка: Не удалось найти лист в файле.'"));
		Эксель.Quit();
		Возврат;
	КонецПопытки;
	
	ПрочитатьЛистExcel(, Страница,1, ,ВсегоСтрок , Эксель);
	
	Эксель.Quit();
	
КонецПроцедуры

#КонецЕсли
